{
	"name": "Blade of the Dooming Sky",
	"source": "WorldofQuesh",
	"page": 3,
	"baseItem": "longsword|PHB",
	"type": "M",
	"rarity": "legendary",
	"reqAttune": "by a creature who was not created or summoned by an ability, item, or spell",
	"weight": 3,
	"weaponCategory": "martial",
	"property": [
		"F",
		"L",
        "V"
	],
	"dmg1": "1d8",
	"dmgType": "S",
    "dmg2": "1d10",
	"entries": [
		"This sword was once given by Kylina herself to be wielded against an ancient red dragon by a powerful devotee. It has a plain, dark-colored blade with pale flecks in its metal and a simple hilt. An icon of a blazing meteor with the trail built into the hilt serves as the pommel and is quite warm to the touch.",
		"The weapon gains the finesse property.",
		{
			"type": "entries",
			"name": "Sentience",
			"entries": [
				"The Blade of the Dooming Sky is a sentient neutral weapon with an Intelligence of 14, a Wisdom of 16, and a Charisma of 20. It has hearing and {@sense darkvision} out to a range of 60 feet.",
				"The weapon communicates telepathically with its wielder and can speak, read, and understand Celestial and Common."
			]
		},
		{
			"type": "entries",
			"name": "Personality",
			"entries": [
				"The spirit of the sword's original wielder, Ser Theresa Pratanik, lives within the Blade of the Dooming Sky, having chosen to rest there rather than simply serve Kylina in her own realm. Her spirit strives to protect the blade's wielder and those dear to them. Though she may question the wielder's actions and motivations, she is bound to serve and protect them."
			]
		},
		{
			"type": "entries",
			"name": "Dormant",
			"entries": [
				"The dagger grants the following benefits in its dormant state:",
				{
					"type": "list",
					"items": [
						"You can speak, read, and write Celestial.",
						"You gain a +1 bonus to attack and damage rolls made with this magic weapon.",
						"When you hit a creature with an attack with this weapon, you can choose for the attack to deal an extra {@damage 1d8} fire damage.",
						"The weapon has one {@table Artifact Properties; Minor Beneficial Properties|dmg|minor beneficial} property and one {@table Artifact Properties; Minor Detrimental Properties|dmg|minor detrimental} property, which are determined separately for each different attuned wielder."
					]
				}
			]
		},
		{
			"type": "entries",
			"name": "Awakened",
			"entries": [
				"When the blade reaches an awakened state, it gains the following properties:",
				{
					"type": "list",
					"items": [
						"The weapon's bonus to attack and damage rolls increases to +2.",
						"You can cast the {@spell Melf's minute meteors|XGE} spell (save DC 15) at a level equal to 1 plus your proficiency bonus. You can use this property once, and you regain the ability to do so each day at dawn.",
						"You can cast the {@spell summon celestial|TCE} spell (no concentration required), summoning the spirit of Ser Theresa Pratanik to fight for you. The spirit's statistics are modified in the following ways: its Intelligence, Wisdom, and Charisma scores are those of the Blade of the Dooming Sky; it has resistance to fire damage; and its weapon attacks use your spell attack modifier if you are a spellcaster, or your proficiency bonus plus your Charisma modifier if you are not. You can use this property once, and regain the ability to do so each day at dusk."
					]
				}
			]
		},
		{
			"type": "entries",
			"name": "Exalted",
			"entries": [
				"The blade can only be in an exalted state when attuned by a follower of Kylina. When the blade reaches an exalted state, it gains the following properties:",
				{
					"type": "list",
					"items": [
						"The weapon's bonus to attack and damage rolls increases to +3.",
						"Fire damage dealt with this weapon treats targets with immunity to fire damage as if they had resistance to fire damage instead of immunity.",
						"When you cast the {@spell Melf's minute meteors|XGE} spell from this weapon, its DC is 17 rather than 15.",
						"You can cast the {@spell meteor swarm} spell (DC 17). When cast in this way, you choose only one point on the ground that you can see within range, rather than four. You can use this property once, and you regain the ability to do so each month at dusk on the night of the new moon.",
						"When you summon the blade's spirit, it is summoned as if the {@spell summon celestial|TCE} was cast at a level equal to 3 plus your proficiency bonus. Additionally, while the spirit is summoned, you gain immunity to the {@condition frightened} condition.",
						"The weapon gains a {@table Artifact Properties; Major Beneficial Properties|dmg|major beneficial} property and a {@table Artifact Properties; Major Detrimental Properties|dmg|major detrimental} property, which are determined separately for each different attuned wielder."
					]
				}
			]
		}		
	]
}